#### Wood Members

---

|  |
| --- |
| Wood Class   Properties   See Also |

The  Wood  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | TextureAngle | The property labeled "Angle" from the "Wood" schema. |
| Public property Static member | TextureLinkTextureTransforms | The property labeled "Link Transforms" from the "Wood" schema. |
| Public property Static member | TextureRealWorldOffsetX | The property labeled "Offset X" from the "Wood" schema. |
| Public property Static member | TextureRealWorldOffsetY | The property labeled "Offset Y" from the "Wood" schema. |
| Public property Static member | TextureRealWorldOffsetZ | The property labeled "Offset Z" from the "Wood" schema. |
| Public property Static member | WoodAxialNoise | The property labeled "Axial Noise" from the "Wood" schema. |
| Public property Static member | WoodColor1 | The property labeled "Color 1" from the "Wood" schema. |
| Public property Static member | WoodColor2 | The property labeled "Color 2" from the "Wood" schema. |
| Public property Static member | WoodRadialNoise | The property labeled "Radial Noise" from the "Wood" schema. |
| Public property Static member | WoodThickness | The property labeled "Grain Thickness" from the "Wood" schema. |

# See Also

Wood Class

Autodesk.Revit.DB.Visual Namespace